app/controllers/admin_controller.rb

UPDATE "employees" SET "designation" = ?, "email" = ?, "dateofjoin" = ?, "address" = ?, "updated_at" = ? WHERE "employees"."id" = ?
---
  def update
    @employee = Employee.find(params[:id])
    if @employee.update_attributes(employee_updparams)