app/controllers/admin_controller.rb

SELECT  "employees".* FROM "employees" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "employees"
---
  def index
    #@employee=Employee.all

    @employee = Employee.order("created_at DESC").paginate(page: params[:page], :per_page => 2)

INSERT INTO "employees" ("name", "email", "created_at", "updated_at", "password_digest", "designation", "dateofjoin", "gender", "address", "phone", "active", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_signup_params)
    if @employee.save

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "employees" SET "address" = ?, "active" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["address", "asdsd hhhhhh fffff"], ["active", "t"], ["updated_at", "2018-01-05 12:28:29.578641"], ["id", 6]]
---
  def update
    @employee = Employee.find(params[:id])
    if @employee.update_attributes(employee_updparams)