app/controllers/adminsession_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."email" = ? LIMIT ?  [["email", "lvaguez@gmail.com"], ["LIMIT", 1]]
---
  def create
    employee = Employee.find_by(email: params[:session][:email].downcase)