app/controllers/employees_controller.rb

UPDATE "employees" SET "fb_logged_in" = ?, "fb_posts" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["fb_logged_in", "t"], ["fb_posts", "Levi Vaguez shared Dank Memes Malayalam's video."], ["updated_at", "2018-01-24 05:01:58.692858"], ["id", 5]]
---
  def edit
    @employee = current_employee

    if params["fb"]
      config = request.env['omniauth.auth']['credentials']
      @graph = Koala::Facebook::API.new(config['token'])

      @user = @graph.get_object('me?fields=picture,name,email,birthday,hometown,location,posts')
      @user = {} if @user.nil?
      @user['birthday'] = date_converter(@user['birthday']) if !@user['birthday'].nil?
      # debugger
      # @user['hometown'] = {name: nil} if @user['hometown'].nil?
      # @user['location'] = {name: nil} if @user['location'].nil?
      # @user['posts'] = {data: [{story: nil, message: nil}]}  if (@user['posts'].nil? || @user['posts']['data'].nil? || @user['posts']['data'][0].nil?)
      #@user['picture'] = {data: {url: nil}} if (@user['picture'].nil? || @user['picture'][data].nil? )
      @employee.update_attributes(fb_logged_in: true,
                                  fb_email: @user['email'],
                                  fb_birthday: @user['birthday'],
                                  fb_name: @user['name'],
                                  picture: @user.fetch('picture',{}).fetch('data',{}).fetch('url',nil).to_s,
                                  home_town: @user.fetch('hometown', {}).fetch('name', nil),
                                  fb_location: @user.fetch('location', {}).fetch( 'name', nil),
                                  fb_posts: @user.fetch('posts', {}).fetch('data', {}).fetch(0, {}).fetch('story', nil)
                                  )

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "employees" SET "dateofbirth" = ?, "personalemail" = ?, "image" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["dateofbirth", "1994-04-21"], ["personalemail", "sandeepks2255@gmail.com"], ["image", "ruby_PNG47.png"], ["updated_at", "2018-01-03 06:48:23.115858"], ["id", 2]]
---
  def update
    @employee = Employee.find(params[:id])
    if @employee.update_attributes(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 4]]
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def destroy
    Employee.find(params[:id]).destroy