app/controllers/employees_controller.rb

UPDATE "employees" SET "dateofbirth" = ?, "personalemail" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["dateofbirth", "1994-12-10"], ["personalemail", "foo@bar.com"], ["updated_at", "2018-01-03 06:49:29.017216"], ["id", 787258272]]
---
  def update
    @employee = Employee.find(params[:id])
    if @employee.update_attributes(employee_params)